fio/results/docker.log
sequential-fill: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
seq-read-1: (g=1): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
seq-read-2: (g=2): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=2
random-write-16: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
random-write-16x8: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
random-read-16: (g=5): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
random-read-16x8: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
mixed-random-rw-32x8: (g=7): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 29 threads

sequential-fill: (groupid=0, jobs=1): err= 0: pid=8: Wed Jul 13 13:11:27 2022
  Description  : [Sequential fill phase]
  write: IOPS=396, BW=396MiB/s (415MB/s)(16.0GiB/41366msec)
    slat (usec): min=235, max=36783, avg=314.43, stdev=745.95
    clat (msec): min=4, max=130, avg=40.07, stdev= 4.59
     lat (msec): min=5, max=130, avg=40.39, stdev= 4.53
    clat percentiles (msec):
     |  1.00th=[   40],  5.00th=[   40], 10.00th=[   40], 20.00th=[   40],
     | 30.00th=[   40], 40.00th=[   40], 50.00th=[   41], 60.00th=[   41],
     | 70.00th=[   41], 80.00th=[   41], 90.00th=[   41], 95.00th=[   41],
     | 99.00th=[   47], 99.50th=[   66], 99.90th=[  117], 99.95th=[  125],
     | 99.99th=[  130]
   bw (  KiB/s): min=242839, max=406887, per=83.05%, avg=336834.73, stdev=14313.11, samples=82
   iops        : min=  237, max=  397, avg=328.66, stdev=13.96, samples=82
  lat (msec)   : 10=0.14%, 20=0.22%, 50=98.71%, 100=0.75%, 250=0.18%
  cpu          : usr=2.73%, sys=7.89%, ctx=16431, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,16384,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
seq-read-1: (groupid=1, jobs=1): err= 0: pid=9: Wed Jul 13 13:11:27 2022
   read: IOPS=330, BW=330MiB/s (346MB/s)(16.0GiB/49630msec)
    slat (usec): min=256, max=874, avg=259.92, stdev= 7.71
    clat (usec): min=2726, max=3095, avg=2766.30, stdev=13.38
     lat (usec): min=2993, max=3971, avg=3026.61, stdev=16.51
    clat percentiles (usec):
     |  1.00th=[ 2737],  5.00th=[ 2737], 10.00th=[ 2737], 20.00th=[ 2769],
     | 30.00th=[ 2769], 40.00th=[ 2769], 50.00th=[ 2769], 60.00th=[ 2769],
     | 70.00th=[ 2769], 80.00th=[ 2769], 90.00th=[ 2769], 95.00th=[ 2769],
     | 99.00th=[ 2802], 99.50th=[ 2802], 99.90th=[ 2802], 99.95th=[ 2835],
     | 99.99th=[ 2835]
   bw (  KiB/s): min=232144, max=336579, per=69.97%, avg=236545.63, stdev=10233.24, samples=98
   iops        : min=  226, max=  328, avg=230.47, stdev= 9.99, samples=98
  lat (msec)   : 4=100.00%
  cpu          : usr=0.07%, sys=3.80%, ctx=16494, majf=0, minf=255
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=16384,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
seq-read-2: (groupid=2, jobs=1): err= 0: pid=10: Wed Jul 13 13:11:27 2022
   read: IOPS=396, BW=396MiB/s (415MB/s)(16.0GiB/41358msec)
    slat (usec): min=191, max=794, avg=227.68, stdev=33.70
    clat (usec): min=2979, max=10934, avg=4817.75, stdev=263.70
     lat (usec): min=3328, max=11144, avg=5045.82, stdev=261.26
    clat percentiles (usec):
     |  1.00th=[ 3949],  5.00th=[ 4424], 10.00th=[ 4621], 20.00th=[ 4752],
     | 30.00th=[ 4752], 40.00th=[ 4817], 50.00th=[ 4817], 60.00th=[ 4817],
     | 70.00th=[ 4883], 80.00th=[ 4883], 90.00th=[ 5080], 95.00th=[ 5276],
     | 99.00th=[ 5735], 99.50th=[ 5800], 99.90th=[ 5997], 99.95th=[ 5997],
     | 99.99th=[ 8717]
   bw (  KiB/s): min=382293, max=404927, per=95.14%, avg=385947.07, stdev=2314.71, samples=82
   iops        : min=  373, max=  395, avg=376.52, stdev= 2.28, samples=82
  lat (msec)   : 4=1.43%, 10=98.56%, 20=0.01%
  cpu          : usr=0.08%, sys=3.68%, ctx=16486, majf=0, minf=256
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=16384,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2
random-write-16: (groupid=3, jobs=1): err= 0: pid=11: Wed Jul 13 13:11:27 2022
  Description  : [Random write steady state phase]
  write: IOPS=42.3k, BW=165MiB/s (173MB/s)(9919MiB/60001msec)
    slat (nsec): min=12992, max=79392, avg=18265.46, stdev=3020.14
    clat (usec): min=27, max=970, avg=357.06, stdev=14.91
     lat (usec): min=48, max=984, avg=375.64, stdev=15.81
    clat percentiles (usec):
     |  1.00th=[  343],  5.00th=[  347], 10.00th=[  351], 20.00th=[  351],
     | 30.00th=[  351], 40.00th=[  355], 50.00th=[  355], 60.00th=[  355],
     | 70.00th=[  359], 80.00th=[  363], 90.00th=[  367], 95.00th=[  371],
     | 99.00th=[  396], 99.50th=[  400], 99.90th=[  594], 99.95th=[  594],
     | 99.99th=[  611]
   bw (  KiB/s): min=118427, max=143344, per=78.29%, avg=132518.32, stdev=2202.05, samples=119
   iops        : min=29606, max=35836, avg=33129.18, stdev=550.55, samples=119
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.01%, 500=99.74%, 750=0.26%
  lat (usec)   : 1000=0.01%
  cpu          : usr=18.19%, sys=81.36%, ctx=84, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2539194,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-write-16x8: (groupid=4, jobs=8): err= 0: pid=12: Wed Jul 13 13:11:27 2022
  Description  : [Random write steady state phase]
  write: IOPS=99.3k, BW=388MiB/s (407MB/s)(22.9GiB/60466msec)
    slat (usec): min=12, max=568116, avg=22.27, stdev=799.75
    clat (usec): min=32, max=1142.5k, avg=1249.96, stdev=7523.55
     lat (usec): min=46, max=1142.7k, avg=1272.67, stdev=7585.76
    clat percentiles (usec):
     |  1.00th=[   404],  5.00th=[   799], 10.00th=[  1012], 20.00th=[  1045],
     | 30.00th=[  1074], 40.00th=[  1090], 50.00th=[  1139], 60.00th=[  1172],
     | 70.00th=[  1221], 80.00th=[  1254], 90.00th=[  1287], 95.00th=[  1336],
     | 99.00th=[  1631], 99.50th=[  1860], 99.90th=[  9634], 99.95th=[ 15926],
     | 99.99th=[566232]
   bw (  KiB/s): min=   18, max=137196, per=8.74%, avg=34715.37, stdev=11673.57, samples=941
   iops        : min=    4, max=34299, avg=8678.47, stdev=2918.40, samples=941
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.01%, 500=3.31%, 750=0.93%
  lat (usec)   : 1000=4.49%
  lat (msec)   : 2=90.89%, 4=0.18%, 10=0.10%, 20=0.06%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=5.84%, sys=26.51%, ctx=1336423, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,6003919,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-read-16: (groupid=5, jobs=1): err= 0: pid=20: Wed Jul 13 13:11:27 2022
  Description  : [Random read steady state phase]
   read: IOPS=48.8k, BW=190MiB/s (200MB/s)(11.2GiB/60001msec)
    slat (usec): min=11, max=322, avg=15.42, stdev= 3.13
    clat (usec): min=86, max=800, avg=310.09, stdev=14.67
     lat (usec): min=108, max=814, avg=325.86, stdev=15.20
    clat percentiles (usec):
     |  1.00th=[  277],  5.00th=[  285], 10.00th=[  293], 20.00th=[  302],
     | 30.00th=[  306], 40.00th=[  310], 50.00th=[  310], 60.00th=[  314],
     | 70.00th=[  314], 80.00th=[  318], 90.00th=[  322], 95.00th=[  330],
     | 99.00th=[  371], 99.50th=[  375], 99.90th=[  379], 99.95th=[  383],
     | 99.99th=[  404]
   bw (  KiB/s): min=84153, max=195218, per=51.95%, avg=101323.70, stdev=8891.47, samples=119
   iops        : min=21038, max=48804, avg=25330.54, stdev=2222.86, samples=119
  lat (usec)   : 100=0.01%, 250=0.01%, 500=99.99%, 750=0.01%, 1000=0.01%
  cpu          : usr=19.29%, sys=80.47%, ctx=71, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=2925930,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-read-16x8: (groupid=6, jobs=8): err= 0: pid=21: Wed Jul 13 13:11:27 2022
  Description  : [Random read steady state phase]
   read: IOPS=99.4k, BW=388MiB/s (407MB/s)(22.8GiB/60002msec)
    slat (usec): min=11, max=1026.7k, avg=25.42, stdev=422.79
    clat (usec): min=259, max=1026.9k, avg=1255.60, stdev=1812.67
     lat (usec): min=285, max=1027.2k, avg=1281.55, stdev=1863.09
    clat percentiles (usec):
     |  1.00th=[  938],  5.00th=[ 1106], 10.00th=[ 1139], 20.00th=[ 1156],
     | 30.00th=[ 1172], 40.00th=[ 1188], 50.00th=[ 1205], 60.00th=[ 1205],
     | 70.00th=[ 1221], 80.00th=[ 1254], 90.00th=[ 1369], 95.00th=[ 1795],
     | 99.00th=[ 2147], 99.50th=[ 2245], 99.90th=[ 2474], 99.95th=[ 2606],
     | 99.99th=[12780]
   bw (  KiB/s): min= 1873, max=66103, per=6.13%, avg=24383.11, stdev=3589.34, samples=943
   iops        : min=  468, max=16525, avg=6095.39, stdev=897.34, samples=943
  lat (usec)   : 500=0.05%, 750=0.03%, 1000=1.95%
  lat (msec)   : 2=95.70%, 4=2.24%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=5.82%, sys=26.79%, ctx=1805641, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=5967136,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
mixed-random-rw-32x8: (groupid=7, jobs=8): err= 0: pid=29: Wed Jul 13 13:11:27 2022
   read: IOPS=47.5k, BW=186MiB/s (195MB/s)(10.9GiB/60001msec)
    slat (usec): min=11, max=6332, avg=109.94, stdev=63.78
    clat (usec): min=85, max=13384, avg=3676.24, stdev=422.80
     lat (usec): min=146, max=13521, avg=3786.67, stdev=428.87
    clat percentiles (usec):
     |  1.00th=[ 2769],  5.00th=[ 3032], 10.00th=[ 3195], 20.00th=[ 3359],
     | 30.00th=[ 3458], 40.00th=[ 3589], 50.00th=[ 3654], 60.00th=[ 3752],
     | 70.00th=[ 3851], 80.00th=[ 3982], 90.00th=[ 4146], 95.00th=[ 4293],
     | 99.00th=[ 4686], 99.50th=[ 4948], 99.90th=[ 6718], 99.95th=[ 7504],
     | 99.99th=[10683]
   bw (  KiB/s): min=21288, max=24769, per=12.52%, avg=23810.44, stdev=397.80, samples=959
   iops        : min= 5322, max= 6192, avg=5952.30, stdev=99.50, samples=959
  write: IOPS=20.4k, BW=79.5MiB/s (83.4MB/s)(4771MiB/60001msec)
    slat (usec): min=13, max=6302, avg=112.45, stdev=66.09
    clat (usec): min=4, max=13152, avg=3608.76, stdev=424.74
     lat (usec): min=41, max=13465, avg=3721.74, stdev=434.04
    clat percentiles (usec):
     |  1.00th=[ 2606],  5.00th=[ 2966], 10.00th=[ 3130], 20.00th=[ 3294],
     | 30.00th=[ 3425], 40.00th=[ 3523], 50.00th=[ 3621], 60.00th=[ 3720],
     | 70.00th=[ 3818], 80.00th=[ 3949], 90.00th=[ 4080], 95.00th=[ 4228],
     | 99.00th=[ 4490], 99.50th=[ 4621], 99.90th=[ 4948], 99.95th=[ 5211],
     | 99.99th=[10683]
   bw (  KiB/s): min= 8824, max=10877, per=12.52%, avg=10196.43, stdev=280.98, samples=959
   iops        : min= 2206, max= 2719, avg=2548.96, stdev=70.31, samples=959
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.04%, 4=82.17%, 10=17.73%, 20=0.02%
  cpu          : usr=4.37%, sys=21.86%, ctx=3339475, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=2852307,1221490,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=396MiB/s (415MB/s), 396MiB/s-396MiB/s (415MB/s-415MB/s), io=16.0GiB (17.2GB), run=41366-41366msec

Run status group 1 (all jobs):
   READ: bw=330MiB/s (346MB/s), 330MiB/s-330MiB/s (346MB/s-346MB/s), io=16.0GiB (17.2GB), run=49630-49630msec

Run status group 2 (all jobs):
   READ: bw=396MiB/s (415MB/s), 396MiB/s-396MiB/s (415MB/s-415MB/s), io=16.0GiB (17.2GB), run=41358-41358msec

Run status group 3 (all jobs):
  WRITE: bw=165MiB/s (173MB/s), 165MiB/s-165MiB/s (173MB/s-173MB/s), io=9919MiB (10.4GB), run=60001-60001msec

Run status group 4 (all jobs):
  WRITE: bw=388MiB/s (407MB/s), 388MiB/s-388MiB/s (407MB/s-407MB/s), io=22.9GiB (24.6GB), run=60466-60466msec

Run status group 5 (all jobs):
   READ: bw=190MiB/s (200MB/s), 190MiB/s-190MiB/s (200MB/s-200MB/s), io=11.2GiB (11.0GB), run=60001-60001msec

Run status group 6 (all jobs):
   READ: bw=388MiB/s (407MB/s), 388MiB/s-388MiB/s (407MB/s-407MB/s), io=22.8GiB (24.4GB), run=60002-60002msec

Run status group 7 (all jobs):
   READ: bw=186MiB/s (195MB/s), 186MiB/s-186MiB/s (195MB/s-195MB/s), io=10.9GiB (11.7GB), run=60001-60001msec
  WRITE: bw=79.5MiB/s (83.4MB/s), 79.5MiB/s-79.5MiB/s (83.4MB/s-83.4MB/s), io=4771MiB (5003MB), run=60001-60001msec

Disk stats (read/write):
  nvme0n1: ios=11778120/9781974, merge=0/1832, ticks=7746404/7310728, in_queue=15096532, util=98.47%